Revit 2027 API
BuiltInFailures.FabricFailures.NoWireMaterialDensity Property
 Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoWireMaterialDensity { get; }
Public Shared ReadOnly Property NoWireMaterialDensity As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoWireMaterialDensity {
	FailureDefinitionId^ get ();
}
static member NoWireMaterialDensity : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace